# -*- coding:utf-8 -*-
# author: zby
# email: by951118@163.com
# date: 2021/11/10

import re
import os
import time
import requests
import json
from elasticsearch import Elasticsearch
from requests_html import HTMLSession
from urllib.parse import urljoin
from io import StringIO
from psycopg2 import extras as ex

import psycopg2
import configparser

parent_dir = os.path.dirname(os.path.abspath(__file__))
conf = configparser.ConfigParser()
conf.read(os.getcwd()+"\currency_module\config.ini", encoding="utf-8")
# conf.read(os.getcwd()+"\currency_module\config.ini", encoding="utf-8")


task_files_count = int(conf.get("TaskSchedul", "task_files_count"))


class PgDB():

    def __repr__(self):
        print("Pg 数据操作")

    @classmethod
    def Pg_connect(cls)->object:
        hosts = conf.get("Pg", "hosts")
        port = conf.get("Pg", "port")
        user = conf.get("Pg", "user")
        password = conf.get("Pg", "password")
        database = conf.get("Pg", "database")
        conn = psycopg2.connect(database=database, user=user, password=password, host=hosts, port=port)
        return conn

    # 单条插入
    @classmethod
    def Pg_write(cls,sql, params):
        conn  = cls.Pg_connect()
        cursor = conn.cursor()
        # 方法一
        # sql = """INSERT INTO student (num, name) VALUES (%s, %s)"""
        # params = (101, 'zszxz')

        # 方法二
        # sql = """INSERT INTO student (num, name) VALUES (%(num)s, %(name)s)"""
        # params = {'num': 102, 'name': 'zszxz'}
        cursor.execute(sql, params)
        conn.commit()
        conn.close()

    # 批量插入
    @classmethod
    def Pg_list_write(cls,sql, datalist):
        # datalist 是个list,里面是数组形式
        # sql = """INSERT INTO sjzt_wcm_website_zjs (id,site_id, site_name,url,board_id,detail_id,update_time,create_time,create_time_stamp,detail_url,sjzt_wcm_websites,update_time2) VALUES %s"""
        conn = cls.Pg_connect()
        cursor = conn.cursor()
        ex.execute_values(cursor, sql, datalist, page_size=10000)
        conn.commit()
        conn.close()


    @classmethod
    def update_set(cls,table,id=None,update_sql=None): #只传入id就只更新update_time

        if update_sql:
            update_sql =update_sql
        elif id:
            update_time = int(time.time())
            update_sql = "UPDATE {table} SET update_time={update_time} WHERE id='{id}'".format(table=table,update_time=update_time,id=id)
        else:
            print("Error:id,update_sql meanwhile Null")
        conn = cls.Pg_connect()
        cursor = conn.cursor()
        cursor.execute(update_sql)
        conn.commit()
        cursor.close()
        conn.close()

    # 异步内存插入
    @classmethod
    def Pg_StringIO_write(cls,sql):
        pass


    # 去重查询
    @classmethod
    def Whether_exist(cls,sql):
        # PgDB.whether_exist("SELECT * FROM sjzt_wcm_users WHERE profile_url ='https://xueqiu.com/u/1191579772'")
        conn = cls.Pg_connect()
        cursor = conn.cursor()
        cursor.execute(sql)
        select_value = cursor.fetchone()
        conn.commit()
        conn.close()
        return select_value

    # 取任务
    @classmethod
    def _fetchall(cls, sql):
        # PgDB.whether_exist("SELECT * FROM sjzt_wcm_website WHERE profile_url =''")
        conn = cls.Pg_connect()
        cursor = conn.cursor()
        cursor.execute(sql)
        select_value = cursor.fetchall()
        conn.commit()
        conn.close()
        return select_value


class EsDB():

    def __repr__(self):
        print("Es 数据操作")

    @classmethod
    def Es_connect(cls):
        hosts = conf.get("Es", "hosts")
        user = conf.get("Es", "user")
        password = conf.get("Es", "password")
        es = Elasticsearch(hosts=hosts, sniff_on_start=True, http_auth=(user, password),
                           sniff_on_connection_fail=True, sniffer_timeout=60
                           , ignore=[400, 405, 502], timeout=60)  # 以列表的形式忽略多个状态码
        return es

    @classmethod
    def es_scroll_scroll(cls,es,query_json,index_name=None):
        # es = cls.Es_connect()
        if not index_name:
            index_name = conf.get("Es", "index_name")
        # query_json = {"query":{"bool":{"must":[{"terms":{"i_bn.keyword":["雪球号-刘旷", "雪球号-招商环保公用事业", "雪球号-唐一军", "雪球号-孤鹰广雁", "雪球号-财经无忌", "雪球号-玩转港股", "雪球号-股树长青", "雪球号-精算盘管家-徐老师", "雪球号-长城研究宏观策略", "雪球号-大道无形我有型", "雪球号-我是罗敏", "雪球号-君择价投研究所", "雪球号-新三板智库官方账号", "雪球号-淡定心灵-长识", "雪球号-Captain-船长", "雪球号-用户1266613249", "雪球号-华创高端制造", "雪球号-岁寒知松柏", "雪球号-港股通", "雪球号-南华期货", "雪球号-君茂资本", "雪球号-招财女_zcn", "雪球号-心静如水_容大", "雪球号-Vita1", "雪球号-戴志锋", "雪球号-扎克英雄", "雪球号-饕餮海", "雪球号-小賈", "雪球号-华钦科技", "雪球号-医药ETF", "雪球号-英雄互娱", "雪球号-薄荷保", "雪球号-空之客", "雪球号-麒麟踏云", "雪球号-新山野", "雪球号-SeattleXP", "雪球号-陈果A股策略", "雪球号-郑恺招商轻工", "雪球号-谭婧在充电", "雪球号-乾明资产", "雪球号-李成东", "雪球号-金牛在肩", "雪球号-valueman", "雪球号-汉和资本", "雪球号-上善若水8341", "雪球号-Jimmylui", "雪球号-沪深300价值", "雪球号-浔兴股份", "雪球号-明鉴云海", "雪球号-中证养老指数基金", "雪球号-巨眼财富", "雪球号-南风行", "雪球号-木瓜移动", "雪球号-huahuen13", "雪球号-定投从零开始", "雪球号-彩水盈盈", "雪球号-三流经济学家", "雪球号-DeepSleeper11", "雪球号-水晶苍蝇拍", "雪球号-欧阳华达", "雪球号-疯投哥", "雪球号-东易日盛", "雪球号-信也科技", "雪球号-不在此山中", "雪球号-馬曼然", "雪球号-迅雷", "雪球号-天月剑", "雪球号-夏志平-愚翁移山", "雪球号-钱牛牛", "雪球号-关注和公告", "雪球号-建信指数酱", "雪球号-博时指慧家", "雪球号-BEWG北控水务", "雪球号-国元谈海外", "雪球号-观媒万象", "雪球号-海通上海", "雪球号-稳定的个人投资者", "雪球号-东旭光电", "雪球号-伊姐新消费观察", "雪球号-量化投资与机器学习", "雪球号-沪深300ETF", "雪球号-小蛋散", "雪球号-万法归宗", "雪球号-静气", "雪球号-飘仙的个人日记", "雪球号-纷美投资者关系", "雪球号-行中衡", "雪球号-宁静的冬日M", "雪球号-逆风远征", "雪球号-不如聊基", "雪球号-鱼跃医疗官方账号", "雪球号-柳华芳思想沙龙", "雪球号-尖子生投资", "雪球号-南方基金", "雪球号-ZW-中网载线", "雪球号-gxl1991", "雪球号-民生加银基金", "雪球号-涨乐财富通", "雪球号-遗笑忘泪", "雪球号-巴黎的價值投資", "雪球号-交银国际", "雪球号-无敌小凡人", "雪球号-平安好医生", "雪球号-ouli822", "雪球号-志明首席分析师", "雪球号-东海基金", "雪球号-汤臣倍健投资者关系", "雪球号-EmilyEasongogo", "雪球号-创金合信基金", "雪球号-小知黄蓝道", "雪球号-长盛基金", "雪球号-i美股", "雪球号-肖立晟宏观经济分析", "雪球号-悦航阳光集团", "雪球号-晨兴资本", "雪球号-万家沪深300增强", "雪球号-海油工程", "雪球号-昭时投资", "雪球号-量化钢铁侠", "雪球号-阑夕", "雪球号-国金基金", "雪球号-淘沙见金", "雪球号-云程泰投资", "雪球号-林子易的视角", "雪球号-庄帅零售电商频道", "雪球号-向毅-海外投资", "雪球号-寒武纪", "雪球号-战胜自己", "雪球号-袁浩然", "雪球号-工业ETF", "雪球号-焦明远", "雪球号-宝盈医疗健康", "雪球号-HIS1963", "雪球号-姓名", "雪球号-华创化工团队", "雪球号-炒饭锅锅", "雪球号-XYQUANT", "雪球号-卫夕", "雪球号-来时一贫如洗", "雪球号-钱皓频道", "雪球号-究极马里奥", "雪球号-吴琳光", "雪球号-宜信财富Creditease", "雪球号-ice_招行谷子地", "雪球号-港股窝轮Jenny", "雪球号-xmutmh", "雪球号-投资者摩西", "雪球号-Alex价值发现者", "雪球号-樂陶88", "雪球号-gogoal", "雪球号-jiancai", "雪球号-wguo3", "雪球号-价值事务所", "雪球号-人工智能AIETF", "雪球号-杨勇胜-招商食品", "雪球号-凌晨25点", "雪球号-小散的逆袭", "雪球号-漠飞", "雪球号-克而瑞地产研究", "雪球号-主动量化与指数增强", "雪球号-逸修1", "雪球号-greatsoup", "雪球号-002615哈尔斯", "雪球号-格雷资产", "雪球号-分析师谢漠烟", "雪球号-不明真相的群众", "雪球号-经纬投研", "雪球号-卓尔智联", "雪球号-凌动智行", "雪球号-PaulWu", "雪球号-基金养熊人", "雪球号-appannie", "雪球号-港股那些事", "雪球号-韩超", "雪球号-新能源汽车ETF", "雪球号-友邦外汇", "雪球号-小小投资人123456", "雪球号-流水不再", "雪球号-壹娱观察", "雪球号-富宝有色", "雪球号-7分钟理财", "雪球号-张光宇", "雪球号-元卫南", "雪球号-兴证国际", "雪球号-woody1234", "雪球号-禹洲地产投关", "雪球号-衣公子的剑", "雪球号-只需要五次", "雪球号-TMT美股研究", "雪球号-门中闲人", "雪球号-京津冀ETF", "雪球号-东兴医海撷珍", "雪球号-happy围观", "雪球号-邹春华", "雪球号-流水白菜", "雪球号-联想控股", "雪球号-互联网斗兽场", "雪球号-史凡可", "雪球号-小饭桌创业课堂", "雪球号-万家中证红利", "雪球号-听天看人", "雪球号-张阿斌", "雪球号-虾里巴人", "雪球号-我其实也不太懂啊", "雪球号-包子君聊基金", "雪球号-Terastar", "雪球号-海通期货", "雪球号-翟根全", "雪球号-瀚漠黑球大帝", "雪球号-伟观宏观", "雪球号-中信建投通信", "雪球号-厂话短说", "雪球号-肖恩大侠", "雪球号-屈庆债券论坛", "雪球号-极致洞察", "雪球号-桒玐嘚", "雪球号-新全球资产配置", "雪球号-学经济家", "雪球号-云与海的彼端", "雪球号-深圳小树投资", "雪球号-倔强的泡沫", "雪球号-罗华阳", "雪球号-华宝财富魔方", "雪球号-加班的会计", "雪球号-何纯在南国", "雪球号-医药价值投资", "雪球号-快哉风919", "雪球号-分析师", "雪球号-全指汽车", "雪球号-运气还是勤奋", "雪球号-猎聘网", "雪球号-荟三板", "雪球号-欢聚集团", "雪球号-见龙聊投资", "雪球号-投基之王", "雪球号-完美世界", "雪球号-用户2808145290", "雪球号-银华基金", "雪球号-勤奋的巴神", "雪球号-扑腾虎", "雪球号-华安证券", "雪球号-Learn_111", "雪球号-Alwaleed", "雪球号-安信通信夏庐生彭虎", "雪球号-大秦公子", "雪球号-周通Jimmy", "雪球号-金鹰核心资源", "雪球号-东兴证券林阳", "雪球号-Tian_THCapital", "雪球号-财智力量", "雪球号-和高资本", "雪球号-Bisure", "雪球号-EBS公用环保研究", "雪球号-SebastianLiu", "雪球号-小小小小小小书童", "雪球号-密西西笔盒", "雪球号-云蒙", "雪球号-叶公好尨", "雪球号-大成基金", "雪球号-坐着不动", "雪球号-泰达宏利逆向混合", "雪球号-银行螺丝钉", "雪球号-二马由之", "雪球号-东达资产管理", "雪球号-很好吃的馒头", "雪球号-同安投资", "雪球号-麦土荣", "雪球号-祝朝安", "雪球号-博爱新开源", "雪球号-常格非", "雪球号-主要消费ETF", "雪球号-钟学秀", "雪球号-复来智投策略", "雪球号-博晖创新", "雪球号-剑胆琴心123", "雪球号-天道骑牛", "雪球号-大白话时事", "雪球号-家用电器指数", "雪球号-广东兴富投资", "雪球号-BAICIR", "雪球号-老马识途观千里", "雪球号-柯林赛福刘宁", "雪球号-财通基金", "雪球号-管大宇2019", "雪球号-上海玖歌投资", "雪球号-汽车之家", "雪球号-诺安基金", "雪球号-喻刚", "雪球号-baorongfu", "雪球号-谦和屋", "雪球号-强哥谈油论气", "雪球号-刘志超", "雪球号-时光投资-summer", "雪球号-白梅雪香", "雪球号-医世无双", "雪球号-安顺", "雪球号-西西定投", "雪球号-老红看光伏", "雪球号-国海富兰克林基金", "雪球号-海盗十八", "雪球号-闲来一坐s话投资", "雪球号-linnany", "雪球号-割总", "雪球号-东先生", "雪球号-晨聊互联网", "雪球号-张翼轸", "雪球号-Frankel", "雪球号-景顺长城", "雪球号-dada26", "雪球号-昵称可以吃", "雪球号-永清环保", "雪球号-woodenfox", "雪球号-oufay", "雪球号-Aghion的投资笔记", "雪球号-西瓜博士", "雪球号-晨晖资本", "雪球号-草帽路飞", "雪球号-啊咪老师", "雪球号-苏宁易购", "雪球号-青侨阳光", "雪球号-全指原材料ETF", "雪球号-前海开源基金", "雪球号-PABIR", "雪球号-奥瑞金种业IR", "雪球号-DRAMeXchange_Ken", "雪球号-安邦金融", "雪球号-丘山有道", "雪球号-对数资产", "雪球号-创世伙伴资本", "雪球号-轻工锋尚", "雪球号-连天雪", "雪球号-上证50AH优选", "雪球号-长城证券马拉松", "雪球号-周矿工啊", "雪球号-美股新手", "雪球号-华夏ETF", "雪球号-她汇理财MsC", "雪球号-史丹利", "雪球号-齐恒辉", "雪球号-楠溪基金", "雪球号-大虎交易", "雪球号-慧博", "雪球号-凯恩嘉图", "雪球号-杨策论股", "雪球号-能力圈", "雪球号-Onlythin", "雪球号-老板电器", "雪球号-价值趋势社", "雪球号-小狮子旺财", "雪球号-CHIN-1-N", "雪球号-格先生与费先生", "雪球号-放眼观美股", "雪球号-史诗般的馒头", "雪球号-w奔波儿霸", "雪球号-山行", "雪球号-投资人李木白", "雪球号-华泰柏瑞基金", "雪球号-刘姝威", "雪球号-全铭_东吴", "雪球号-时光基", "雪球号-深证100指数", "雪球号-Vidantus", "雪球号-国际金融报", "雪球号-比特矿业", "雪球号-Saxo盛宝集团", "雪球号-海亮教育", "雪球号-坚信价值", "雪球号-华宝智投", "雪球号-投资者牛小顿", "雪球号-白韭菜", "雪球号-理财之家官网", "雪球号-国泰基金幸福定投", "雪球号-小美股", "雪球号-秦汉相对论", "雪球号-顺势牛牛", "雪球号-泽平宏观", "雪球号-金鹰稳健成长", "雪球号-掌慧纵盈", "雪球号-深圳迈瑞", "雪球号-汇丰晋信基金", "雪球号-柳文龙数字经济", "雪球号-聚美优品", "雪球号-小5论基", "雪球号-长信量化基金", "雪球号-行舟Drug", "雪球号-球友俱乐部", "雪球号-光华小生", "雪球号-电新邓永康团队", "雪球号-孟永辉频道", "雪球号-高德软件", "雪球号-徐凤俊", "雪球号-肖磊看市", "雪球号-书剑笑傲", "雪球号-观者如芸", "雪球号-中投教育资本集团", "雪球号-搜狐", "雪球号-博弈资产赵翔", "雪球号-海哥商业观察", "雪球号-艺龙旅行网", "雪球号-神州数字8255HK", "雪球号-吴立-天风农业首席", "雪球号-IB美国盈透证券", "雪球号-九鼎集团430719", "雪球号-微笑定投", "雪球号-葛甲", "雪球号-专注医疗消费", "雪球号-转债星球", "雪球号-九阳官方账号", "雪球号-每天一个新发现", "雪球号-平安健康", "雪球号-稳赢小喵", "雪球号-张栋伟", "雪球号-一千二百字", "雪球号-蹊之美股生物医药", "雪球号-熙山资本王威", "雪球号-徐春", "雪球号-光大宏观团队", "雪球号-人人公司", "雪球号-求漏", "雪球号-李定国", "雪球号-安信国际EIS", "雪球号-KBS集团", "雪球号-轻金融", "雪球号-ETF拯救世界", "雪球号-userfield", "雪球号-点牛集团", "雪球号-白虹软件", "雪球号-伊飞2020", "雪球号-忆西风", "雪球号-投高网Charlie", "雪球号-天鸽IR", "雪球号-大水李", "雪球号-东吴证券马莉", "雪球号-三萬", "雪球号-奇虎360", "雪球号-康崇利论市", "雪球号-李想", "雪球号-凡德投资", "雪球号-徐阳的全球宏观视角", "雪球号-戴小卡", "雪球号-价值与空间", "雪球号-宏源食品饮料研究", "雪球号-人生如梦的Dr2", "雪球号-相禾", "雪球号-范力文", "雪球号-科兴控股SVA", "雪球号-小柴研究", "雪球号-北双916", "雪球号-瑞康医药", "雪球号-价值人生的小屋", "雪球号-胡华如", "雪球号-李勇飞-Lee", "雪球号-孔雀明王龙头战队", "雪球号-宋小胖的独幕剧", "雪球号-英大基金", "雪球号-海通e海通财", "雪球号-均胜电子", "雪球号-宝盈互联网", "雪球号-博纳星光", "雪球号-ATP三磷酸腺苷", "雪球号-华海521", "雪球号-印度市场基金", "雪球号-香港交易所脈搏", "雪球号-平点金基", "雪球号-木头人1982", "雪球号-贝瑞基因", "雪球号-呆瓜投研笔记", "雪球号-家传武功", "雪球号-中泰国际", "雪球号-申万菱信基金", "雪球号-businesslike", "雪球号-泰达宏利基金", "雪球号-凡夫经济学", "雪球号-潜龙在渊", "雪球号-林夕西日生", "雪球号-徐风_随风投资", "雪球号-优信", "雪球号-BlackPuma", "雪球号-glnao", "雪球号-流光飞舞", "雪球号-余晓光", "雪球号-二毛爱生活", "雪球号-史密斯岩折鸣", "雪球号-宝盈中证100", "雪球号-刘步尘", "雪球号-五迷", "雪球号-信息技术ETF", "雪球号-小投行日记", "雪球号-ETF财经奶爸", "雪球号-伟彦刘", "雪球号-烟台金正环保", "雪球号-MarsterTalk", "雪球号-二元思考", "雪球号-有色ETF", "雪球号-华扬联众", "雪球号-我有坡道你有雪吗", "雪球号-BlackSmith_", "雪球号-重阳投资", "雪球号-quantek", "雪球号-简七理财", "雪球号-汤诗语", "雪球号-叮当保", "雪球号-何田-建诚晟业", "雪球号-投资干货", "雪球号-皓天财经刘天倪", "雪球号-石油基金", "雪球号-轩言全球宏观", "雪球号-无知小驴", "雪球号-冰眼观市", "雪球号-A6魏然", "雪球号-ETF玩家", "雪球号-RedwoodShores", "雪球号-实话传媒", "雪球号-大道平淡平安", "雪球号-中欧基金", "雪球号-万联研究所", "雪球号-L医生的投资", "雪球号-日月盈仄7", "雪球号-三只老虎的联姻", "雪球号-中证500ETF", "雪球号-抱着鱼干去买股", "雪球号-邓立君", "雪球号-易事特", "雪球号-汽车K线", "雪球号-ESG基金_501086", "雪球号-易车", "雪球号-DAVID自由之路", "雪球号-出去走走吧365", "雪球号-海不归BaB", "雪球号-阳光pan", "雪球号-证券ETF", "雪球号-哔哩哔哩客服娘", "雪球号-海鲨特战旅", "雪球号-贺泽安", "雪球号-医药云端信息", "雪球号-红黄蓝教育RYB", "雪球号-亚美能源", "雪球号-能源小彬", "雪球号-付一夫", "雪球号-快递生态圈赵小敏", "雪球号-中粮家佳康IR", "雪球号-中欧全明星", "雪球号-米内网", "雪球号-平安证券", "雪球号-沈海兵_Michael", "雪球号-MSCI中国A股增强", "雪球号-小小辛巴", "雪球号-GOMEIR", "雪球号-徐若旭团队", "雪球号-鱼香基丝", "雪球号-老牛先生", "雪球号-乐趣", "雪球号-复利60年", "雪球号-朱酒", "雪球号-招证君", "雪球号-优聚资本", "雪球号-光伏指数-011102", "雪球号-an小安", "雪球号-查理冬明", "雪球号-estival", "雪球号-释老毛", "雪球号-持有封基", "雪球号-格雷费舍", "雪球号-牛和智", "雪球号-均衡教派", "雪球号-华泰轻工研究", "雪球号-杨饭", "雪球号-铁公鸡金融", "雪球号-明锐价值", "雪球号-蓝汛投资者关系", "雪球号-IDG资本", "雪球号-小兵oo9", "雪球号-王胜申万宏源", "雪球号-人淡若菊", "雪球号-xiaogoubaba", "雪球号-yxyxyx23", "雪球号-从易", "雪球号-豆粕ETF", "雪球号-宝盈鸿利收益", "雪球号-成长的快乐", "雪球号-上善若水Jasonli", "雪球号-建投非银金融研究", "雪球号-东方基金公司", "雪球号-金斧子财富", "雪球号-SaaS亚谦", "雪球号-北京和聚投资", "雪球号-弱弱的投资者", "雪球号-德意志交易所集团", "雪球号-成长ETF", "雪球号-前海卓成投资", "雪球号-sparkzy", "雪球号-申万轻工", "雪球号-滴水石", "雪球号-割资本主义羊毛", "雪球号-润哥", "雪球号-中国有赞", "雪球号-金凤一号", "雪球号-自由的风", "雪球号-恺英网络投资者关系", "雪球号-辛无疾", "雪球号-国联证券", "雪球号-谢恒", "雪球号-sleepless", "雪球号-易论道", "雪球号-谷儒新经济研究", "雪球号-富国基金", "雪球号-吴圣涛", "雪球号-仓又加错-Leo", "雪球号-陈福力2012", "雪球号-卓凯基金", "雪球号-汽车电子设计", "雪球号-交银基金", "雪球号-华夏科创50ETF", "雪球号-无围", "雪球号-探路者官方IR", "雪球号-中二哉", "雪球号-量化招财猫", "雪球号-哒哒哒", "雪球号-玲你看农业食品", "雪球号-磐石之心聊投资", "雪球号-财富自由的大富翁", "雪球号-似曾相识81", "雪球号-尖峰JEFF", "雪球号-王永庆投研笔记", "雪球号-J所长", "雪球号-有智思有财", "雪球号-纳指100", "雪球号-白酒资深研究员", "雪球号-Vimicro", "雪球号-中海基金", "雪球号-苏晨中泰研究所", "雪球号-医药代表只懂医药股", "雪球号-玉山落雨", "雪球号-躺赢君", "雪球号-红塔红土基金", "雪球号-长信基金", "雪球号-一朵喵", "雪球号-混沌太虚", "雪球号-救生队山姆队长", "雪球号-首席楼盘户型分析师", "雪球号-中国忠旺", "雪球号-hotashang", "雪球号-浙商基金", "雪球号-雪山", "雪球号-韩德雨", "雪球号-覃汉", "雪球号-李暮泊", "雪球号-一品白衣", "雪球号-耐力投资", "雪球号-莲子蜂蜜茶", "雪球号-深圳零存整取", "雪球号-陈晓霞", "雪球号-好果胡赛萌", "雪球号-新东方在线", "雪球号-欢无之尘", "雪球号-中国支付通", "雪球号-李君周光大海外", "雪球号-鹏华基金鹏友会", "雪球号-威廉19", "雪球号-军工ETF", "雪球号-异构君", "雪球号-私募早餐会", "雪球号-中国平安", "雪球号-MCorleone", "雪球号-三十观市", "雪球号-刘亚明", "雪球号-潘乱", "雪球号-江瀚视野", "雪球号-上海达任资产", "雪球号-正合奇胜天舒", "雪球号-贫民窟的大富翁", "雪球号-xuehu5417", "雪球号-新券学社", "雪球号-等着蚂蚁变大象", "雪球号-天使客", "雪球号-微进化ing", "雪球号-中贵金库", "雪球号-水金--大尾巴", "雪球号-猎鹿人2001", "雪球号-华泰证券研究所", "雪球号-方锐-肥尾基金", "雪球号-香港大盘_香港本地", "雪球号-洪锦屏", "雪球号-丫丫港股圈", "雪球号-博时投资汇", "雪球号-OL东方园林", "雪球号-Marsfer", "雪球号-朗玛信息", "雪球号-香喷喷的五花肉", "雪球号-郭荆璞", "雪球号-吉普赛007", "雪球号-招银国际", "雪球号-荀玉根", "雪球号-大詹", "雪球号-中邮基金", "雪球号-小生爱财", "雪球号-格老巴老价值投资", "雪球号-车界", "雪球号-Mily", "雪球号-Mario", "雪球号-广证恒生", "雪球号-基金经理", "雪球号-否极泰董宝珍", "雪球号-旺财定投", "雪球号-Roger88", "雪球号-国元互联网研究", "雪球号-zganlu", "雪球号-老秦说币", "雪球号-大隐于市谢强", "雪球号-snowball312", "雪球号-关山", "雪球号-陈宝健-开源计算机", "雪球号-徐佳杰Pierre", "雪球号-醉酒看股", "雪球号-国联安基金", "雪球号-上海世基投资", "雪球号-纳斯达克", "雪球号-龟圣资产", "雪球号-木木_通信", "雪球号-鼎实-复利资产配置", "雪球号-少数派投资", "雪球号-吴欣鸿", "雪球号-燕歸來", "雪球号-保险那点事儿", "雪球号-天弘指数基金", "雪球号-信璞投资", "雪球号-山哥V散", "雪球号-保底的钱", "雪球号-郦道元", "雪球号-雨枫", "雪球号-天下图", "雪球号-自由老木头", "雪球号-leeshevar", "雪球号-江东猫草", "雪球号-老狼牙", "雪球号-薛定谔家的小猫", "雪球号-黑鹰光伏", "雪球号-心中无股HK", "雪球号-tulip郁金香", "雪球号-龙韵股份", "雪球号-张立聪", "雪球号-老宋随想", "雪球号-腾讯公司", "雪球号-养基司令", "雪球号-达安基因官方账号", "雪球号-CMGE中国手游", "雪球号-平凡的那一人", "雪球号-长安基金", "雪球号-广发基金", "雪球号-黄致远", "雪球号-大闰金", "雪球号-尹生", "雪球号-21世纪不动产CTC", "雪球号-金铭儿", "雪球号-电扫洛阳川", "雪球号-用户8168625179", "雪球号-何适投资", "雪球号-梁剑", "雪球号-诺桥基金", "雪球号-双辉", "雪球号-薄纯敏", "雪球号-牧马投资", "雪球号-华创食饮", "雪球号-海融易", "雪球号-毒眸", "雪球号-互联网怪盗团", "雪球号-快牛金科", "雪球号-51信用卡", "雪球号-s_crat", "雪球号-基民的名义", "雪球号-自由的驰骋", "雪球号-自然视野十贰生", "雪球号-恒大金服官方号", "雪球号-房杨凯-众研会", "雪球号-磐厚投研估值中心", "雪球号-龙小九", "雪球号-湘沩山水", "雪球号-花果山藏股社", "雪球号-我是操盘狗", "雪球号-长信可转债", "雪球号-石头定投", "雪球号-国金证券研究所", "雪球号-华泰证券无锡公司", "雪球号-鹤flying", "雪球号-心向阳光奔跑", "雪球号-鹏扬基金", "雪球号-靠谱的阿星", "雪球号-天弘基金", "雪球号-阿手投资", "雪球号-Ten-Bagger", "雪球号-进化论一平", "雪球号-拨云见日", "雪球号-安信基金", "雪球号-基民柠檬", "雪球号-汇添富基金", "雪球号-可选消费ETF", "雪球号---曹刿子鱼", "雪球号-力哥说理财", "雪球号-孥孥的大树", "雪球号-万泰华瑞", "雪球号-张万宏", "雪球号-挖财君", "雪球号-菲恬", "雪球号-越声理财", "雪球号-AQUMON黄博士", "雪球号-吴一凡-华创交运", "雪球号-秋源俊二", "雪球号-黄付生", "雪球号-李妍", "雪球号-三七互娱", "雪球号-万佑希", "雪球号-陈海涛周游世界", "雪球号-吴晨辉", "雪球号-互联网随笔", "雪球号-华泰地产团队", "雪球号-指数增强小迷妹", "雪球号-蜡笔小焦", "雪球号-叶天士", "雪球号-挖掘机", "雪球号-价值投资客", "雪球号-国盛医药张金洋", "雪球号-大作手勺", "雪球号-白水极简", "雪球号-上善山水", "雪球号-喝牛二的战总", "雪球号-云里雾里瞎折腾", "雪球号-长弓侠", "雪球号-油气君", "雪球号-老熊老雄", "雪球号-雅戈尔600177", "雪球号-TLS美股研究", "雪球号-tommyshire", "雪球号-ETP研究猿", "雪球号-中信机械小妖朱颖", "雪球号-二鸟说", "雪球号-青豆芽的世界", "雪球号-柴继军", "雪球号-东品西奏", "雪球号-东吴马婷婷", "雪球号-周黑鸭", "雪球号-okok74", "雪球号-andyding", "雪球号-我是表好胚", "雪球号-奇临信息", "雪球号-红利低波动", "雪球号-StarringLu", "雪球号-百度官方", "雪球号-栅格思维", "雪球号-Lagom投资", "雪球号-般若波罗蜜", "雪球号-戴维斯信徒", "雪球号-中国国际期货", "雪球号-布衣-淡定从容", "雪球号-littleswan", "雪球号-幂数资产大头阿不思", "雪球号-锚定ROEer", "雪球号-51nxp", "雪球号-我是任俊杰", "雪球号-黄建平", "雪球号-处镜如初", "雪球号-许戈财经", "雪球号-科大讯飞", "雪球号-巴赫特", "雪球号-深链财经", "雪球号-杯酒人生", "雪球号-零城逆影", "雪球号-輝立証券_香港", "雪球号-朋克民族", "雪球号-吴向宏", "雪球号-雷军", "雪球号-进化论资产", "雪球号-九泰基金", "雪球号-博时基金", "雪球号-美团点评", "雪球号-博腾股份IR", "雪球号-龙珍量化", "雪球号-医心医意要健康", "雪球号-只要屁股深", "雪球号-林成红", "雪球号-yuange1975", "雪球号-Bitauto_IR", "雪球号-齐丁", "雪球号-环保指数", "雪球号-长城证券官方账号", "雪球号-黑色面包", "雪球号-AI搬砖工", "雪球号-橡谷-唐璞", "雪球号-Stevevai1983", "雪球号-帅牛2", "雪球号-周鸿祎", "雪球号-守株待兔的夹头", "雪球号-巴郡笔记", "雪球号-陈达美股投资", "雪球号-思亮拨千斤", "雪球号-智道金服", "雪球号-中证医疗指数基金", "雪球号-Dinny_Sachs", "雪球号-管我财", "雪球号-金鹰添瑞中短债", "雪球号-恒生ETF", "雪球号-余海坤_赛力斯", "雪球号-基金观察员", "雪球号-李鲲朗", "雪球号-侯建峰", "雪球号-丹书铁券", "雪球号-中信证券_信E投", "雪球号-风林火山球", "雪球号-价值at风险", "雪球号-组合牛魔王", "雪球号-sunnyssj", "雪球号-方何之子", "雪球号-格上财富", "雪球号-量化小王子", "雪球号-华商基金之家", "雪球号-jin888555", "雪球号-金鹰基金", "雪球号-方正富邦", "雪球号-梁宏", "雪球号-weald", "雪球号-网贷之家", "雪球号-钱包金融", "东方财富App-炒股炒预期A998", "东方财富App-财通证券资管", "东方财富App-东方财富期货", "东方财富App-傻馒大天才", "东方财富App-华泰证券资管", "东方财富App-小猴论市", "东方财富App-瑞达期货官方", "东方财富App-股神带头大哥", "东方财富App-熊市飞扬带实战中", "雪球号-金融地产etf", "雪球号-证券ETF-159841", "雪球号-西峯", "雪球号-王剑", "雪球号-谈谈投资", "雪球号-shuning76", "雪球号-坚强的韭菜008", "雪球号-民工君", "雪球号-无名大辈", "雪球号-睿磊资产", "雪球号-夏至1987", "雪球号-青春的泥沼", "雪球号-中小300ETF", "雪球号-fugitives", "雪球号-益谙投资", "雪球号-泓铭资本", "雪球号-招商零售许荣聪", "雪球号-凌动智行CFO", "雪球号-Neo是我", "雪球号-涨基财富", "雪球号-天才基友", "雪球号-上海家化600315", "雪球号-全指能源ETF", "雪球号-太平基金", "雪球号-中信建投策略", "雪球号-互联网分析师Yichun", "头条号-观象台", "雪球号-魏斌杰", "雪球号-邢海芝", "头条号-财联社", "雪球号-指数基金", "雪球号-ali企业投研", "雪球号-光大新鸿基", "头条号-红星新闻", "头条号-封面新闻", "头条号-李大霄", "头条号-每日经济新闻", "头条号-管清友", "头条号-环球网", "头条号-八点财经资讯", "头条号-常州府", "雪球号-二蟲", "雪球号-九卦财经", "雪球号-硅谷牛易", "雪球号-贝塔总动员", "雪球号-杨天南财务健康谈", "雪球号-庞大集团", "雪球号-晶科能源", "雪球号-全景网", "雪球号-集思录", "雪球号-萧何重组指数化投资", "雪球号-草头黄bong", "雪球号-大数据资管圈", "雪球号-王铮", "雪球号-科通芯城", "雪球号-炒股即修行", "雪球号-那一水的鱼", "雪球号-猎云网", "雪球号-用户2089722768", "雪球号-申万500优选增强", "雪球号-时间投资", "雪球号-京北投资", "雪球号-博实", "雪球号-天风证券研究所", "雪球号-财经九号院", "雪球号-数字为王", "雪球号-恒泰证券", "雪球号-sx176391311", "雪球号-猎豹全球智库", "雪球号-肥常"]}}]}},"_source": ["title","i_bid","i_sn","i_sid","url"]}
        page_num = int(conf.get("TaskSchedul", "seed_generation_number"))
        query = es.search(index=index_name, body=query_json, scroll='20m', size=page_num)
        total = query['hits']['total']  # es查询出的结果总量
        scroll_id = query['_scroll_id']  # 游标用于输出es查询出的所有结果
        every_num = int(total/page_num)  #
        return es,every_num,scroll_id

if __name__ == '__main__':
    # EsDB.get_data()
    PgDB.Whether_exist("SELECT * FROM sjzt_wcm_users WHERE profile_url ='https://xueqiu.com/u/1191579772'")